logs/benchmark_20250709_172015/h2_100ms_1pct.log
=== HTTP/2 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-09 17:22:10
Delay: 100ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 1: root refcnt 9 limit 1000 delay 150ms loss 1%
qdisc tbf 10: parent 1:1 rate 600Mbit burst 4050b lat 400ms 

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 50 total requests
spawning thread #1: 5 total client(s). 50 total requests
spawning thread #2: 5 total client(s). 50 total requests
spawning thread #3: 5 total client(s). 50 total requests
spawning thread #4: 5 total client(s). 50 total requests
spawning thread #5: 5 total client(s). 50 total requests
spawning thread #6: 5 total client(s). 50 total requests
spawning thread #7: 5 total client(s). 50 total requests
spawning thread #8: 5 total client(s). 50 total requests
spawning thread #9: 5 total client(s). 50 total requests
spawning thread #10: 5 total client(s). 50 total requests
spawning thread #11: 5 total client(s). 50 total requests
spawning thread #12: 5 total client(s). 50 total requests
spawning thread #13: 5 total client(s). 50 total requests
spawning thread #14: 5 total client(s). 50 total requests
spawning thread #15: 5 total client(s). 50 total requests
spawning thread #16: 5 total client(s). 50 total requests
spawning thread #17: 5 total client(s). 50 total requests
spawning thread #18: 5 total client(s). 50 total requests
spawning thread #19: 5 total client(s). 50 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 89.32ms, 11196.08 req/s, 3.30MB/s
requests: 1000 total, 1000 started, 1000 done, 1000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 301.52KB (308753) total, 207.97KB (212957) headers (space savings 27.81%), 58.59KB (60000) data
                     min         max         mean         sd        +/- sd
time for request:     3.95ms     51.57ms     26.57ms     13.43ms    60.90%
time for connect:     1.66ms     75.44ms     31.29ms     16.78ms    67.00%
time to 1st byte:    19.72ms     88.45ms     57.82ms     22.27ms    64.00%
req/s           :     112.94      503.52      222.82      136.35    75.00%
Waiting 5s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 450 total requests
spawning thread #1: 5 total client(s). 450 total requests
spawning thread #2: 5 total client(s). 450 total requests
spawning thread #3: 5 total client(s). 450 total requests
spawning thread #4: 5 total client(s). 450 total requests
spawning thread #5: 5 total client(s). 450 total requests
spawning thread #6: 5 total client(s). 450 total requests
spawning thread #7: 5 total client(s). 450 total requests
spawning thread #8: 5 total client(s). 450 total requests
spawning thread #9: 5 total client(s). 450 total requests
spawning thread #10: 5 total client(s). 450 total requests
spawning thread #11: 5 total client(s). 450 total requests
spawning thread #12: 5 total client(s). 450 total requests
spawning thread #13: 5 total client(s). 450 total requests
spawning thread #14: 5 total client(s). 450 total requests
spawning thread #15: 5 total client(s). 450 total requests
spawning thread #16: 5 total client(s). 450 total requests
spawning thread #17: 5 total client(s). 450 total requests
spawning thread #18: 5 total client(s). 450 total requests
spawning thread #19: 5 total client(s). 450 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h2
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 711.33ms, 12652.36 req/s, 3.67MB/s
requests: 9000 total, 9000 started, 9000 done, 9000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 9000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 2.61MB (2740390) total, 1.83MB (1916490) headers (space savings 27.82%), 527.34KB (540000) data
                     min         max         mean         sd        +/- sd
time for request:    24.78ms    626.00ms    321.25ms    169.83ms    56.43%
time for connect:     4.90ms    119.53ms     63.55ms     30.42ms    57.00%
time to 1st byte:    36.05ms    632.49ms    332.70ms    178.61ms    58.00%
req/s           :     127.04      937.91      161.96      103.15    96.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/2
Fair Comparison: Enabled
Warmup Requests: 1000
Measurement Requests: 9000
End Time: 2025-07-09 17:22:16
CSV Log: /logs/benchmark_20250709_172015/h2_100ms_1pct.csv