logs/benchmark_20250709_172015/h3_0ms_1pct.log
=== HTTP/3 BENCHMARK RESULTS ===
=== NETWORK CONDITIONS ===
Timestamp: 2025-07-09 17:21:01
Delay: 0ms
Loss: 1%
Router IP: 172.30.0.254
Server IP: 172.30.0.2
Current qdisc configuration:
qdisc netem 1: root refcnt 9 limit 1000 delay 150ms loss 1%
qdisc tbf 10: parent 1:1 rate 600Mbit burst 4050b lat 400ms 

=== CONNECTION ESTABLISHMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 50 total requests
spawning thread #1: 5 total client(s). 50 total requests
spawning thread #2: 5 total client(s). 50 total requests
spawning thread #3: 5 total client(s). 50 total requests
spawning thread #4: 5 total client(s). 50 total requests
spawning thread #5: 5 total client(s). 50 total requests
spawning thread #6: 5 total client(s). 50 total requests
spawning thread #7: 5 total client(s). 50 total requests
spawning thread #8: 5 total client(s). 50 total requests
spawning thread #9: 5 total client(s). 50 total requests
spawning thread #10: 5 total client(s). 50 total requests
spawning thread #11: 5 total client(s). 50 total requests
spawning thread #12: 5 total client(s). 50 total requests
spawning thread #13: 5 total client(s). 50 total requests
spawning thread #14: 5 total client(s). 50 total requests
spawning thread #15: 5 total client(s). 50 total requests
spawning thread #16: 5 total client(s). 50 total requests
spawning thread #17: 5 total client(s). 50 total requests
spawning thread #18: 5 total client(s). 50 total requests
spawning thread #19: 5 total client(s). 50 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 419.69ms, 2382.73 req/s, 663.69KB/s
requests: 1000 total, 1000 started, 1000 done, 1000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 1000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 278.54KB (285225) total, 210.91KB (215969) headers (space savings 26.79%), 60.55KB (62000) data
UDP datagram: 723 sent, 646 received
                     min         max         mean         sd        +/- sd
time for request:     6.40ms    333.78ms    102.50ms    109.23ms    86.50%
time for connect:    63.27ms     85.26ms     73.94ms      8.81ms    48.00%
time to 1st byte:    70.19ms    388.60ms    155.28ms     99.13ms    64.00%
req/s           :      23.94      136.04       74.85       43.65    67.00%
Waiting 5s for connections to stabilize...
=== MEASUREMENT PHASE ===
-t: warning: the number of threads is greater than hardware cores.
starting benchmark...
spawning thread #0: 5 total client(s). 450 total requests
spawning thread #1: 5 total client(s). 450 total requests
spawning thread #2: 5 total client(s). 450 total requests
spawning thread #3: 5 total client(s). 450 total requests
spawning thread #4: 5 total client(s). 450 total requests
spawning thread #5: 5 total client(s). 450 total requests
spawning thread #6: 5 total client(s). 450 total requests
spawning thread #7: 5 total client(s). 450 total requests
spawning thread #8: 5 total client(s). 450 total requests
spawning thread #9: 5 total client(s). 450 total requests
spawning thread #10: 5 total client(s). 450 total requests
spawning thread #11: 5 total client(s). 450 total requests
spawning thread #12: 5 total client(s). 450 total requests
spawning thread #13: 5 total client(s). 450 total requests
spawning thread #14: 5 total client(s). 450 total requests
spawning thread #15: 5 total client(s). 450 total requests
spawning thread #16: 5 total client(s). 450 total requests
spawning thread #17: 5 total client(s). 450 total requests
spawning thread #18: 5 total client(s). 450 total requests
spawning thread #19: 5 total client(s). 450 total requests
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 1.08s, 8299.84 req/s, 2.27MB/s
requests: 9000 total, 9000 started, 9000 done, 9000 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 9000 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 2.47MB (2584954) total, 1.85MB (1943554) headers (space savings 26.80%), 544.92KB (558000) data
UDP datagram: 1528 sent, 3096 received
                     min         max         mean         sd        +/- sd
time for request:     2.28ms    599.68ms    279.51ms    174.59ms    57.16%
time for connect:    81.93ms       1.04s    138.01ms    205.85ms    95.00%
time to 1st byte:    90.64ms       1.04s    155.37ms    202.78ms    95.00%
req/s           :      83.03      277.08      134.99       26.46    90.00%

=== BENCHMARK SUMMARY ===
Protocol: HTTP/3 (confirmed)
Fair Comparison: Enabled
Warmup Requests: 1000
Measurement Requests: 9000
End Time: 2025-07-09 17:21:07
CSV Log: /logs/benchmark_20250709_172015/h3_0ms_1pct.csv